export const regions = [
    'Москва',
    'Санкт-Петербург',
    'Республика Адыгея',
    'Республика Алтай',
    'Республика Башкортостан',
    'Республика Саха (Якутия)',
  ];
  
export const getCitiesByRegion = (region: string): string[] => {
  const citiesMap: Record<string, string[]> = {
    'Москва': ['Москва'],
    'Санкт-Петербург': ['Санкт-Петербург'],
    'Республика Адыгея': ['Майкоп', 'Адыгейск'],
    'Республика Алтай': ['Горно-Алтайск'],
    'Республика Башкортостан': ['Уфа', 'Стерлитамак', 'Салават'],
    'Республика Саха (Якутия)': ['Якутск', 'Вилюйск', 'Мирный'],
  };

  return citiesMap[region] || [];
};